_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 160, 160, 3)       0         
_________________________________________________________________
separable_conv2d_keras_116 ( (None, 160, 160, 32)      155       
_________________________________________________________________
batch_normalization_127 (Bat (None, 160, 160, 32)      128       
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 80, 80, 32)        0         
_________________________________________________________________
separable_conv2d_keras_117 ( (None, 80, 80, 64)        2400      
_________________________________________________________________
batch_normalization_128 (Bat (None, 80, 80, 64)        256       
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 40, 40, 64)        0         
_________________________________________________________________
separable_conv2d_keras_118 ( (None, 40, 40, 128)       8896      
_________________________________________________________________
batch_normalization_129 (Bat (None, 40, 40, 128)       512       
_________________________________________________________________
separable_conv2d_keras_119 ( (None, 40, 40, 128)       17664     
_________________________________________________________________
batch_normalization_130 (Bat (None, 40, 40, 128)       512       
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 20, 20, 128)       0         
_________________________________________________________________
separable_conv2d_keras_120 ( (None, 20, 20, 256)       34176     
_________________________________________________________________
batch_normalization_131 (Bat (None, 20, 20, 256)       1024      
_________________________________________________________________
separable_conv2d_keras_121 ( (None, 20, 20, 256)       68096     
_________________________________________________________________
batch_normalization_132 (Bat (None, 20, 20, 256)       1024      
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 10, 10, 256)       0         
_________________________________________________________________
separable_conv2d_keras_122 ( (None, 10, 10, 256)       68096     
_________________________________________________________________
batch_normalization_133 (Bat (None, 10, 10, 256)       1024      
_________________________________________________________________
separable_conv2d_keras_123 ( (None, 10, 10, 256)       68096     
_________________________________________________________________
batch_normalization_134 (Bat (None, 10, 10, 256)       1024      
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 5, 5, 256)         0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 5, 5, 512)         131584    
_________________________________________________________________
batch_normalization_135 (Bat (None, 5, 5, 512)         2048      
_________________________________________________________________
bilinear_up_sampling2d_48 (B (None, 10, 10, 512)       0         
_________________________________________________________________
concatenate_48 (Concatenate) (None, 10, 10, 768)       0         
_________________________________________________________________
separable_conv2d_keras_124 ( (None, 10, 10, 256)       203776    
_________________________________________________________________
batch_normalization_136 (Bat (None, 10, 10, 256)       1024      
_________________________________________________________________
bilinear_up_sampling2d_49 (B (None, 20, 20, 256)       0         
_________________________________________________________________
concatenate_49 (Concatenate) (None, 20, 20, 384)       0         
_________________________________________________________________
separable_conv2d_keras_125 ( (None, 20, 20, 256)       102016    
_________________________________________________________________
batch_normalization_137 (Bat (None, 20, 20, 256)       1024      
_________________________________________________________________
bilinear_up_sampling2d_50 (B (None, 40, 40, 256)       0         
_________________________________________________________________
concatenate_50 (Concatenate) (None, 40, 40, 320)       0         
_________________________________________________________________
separable_conv2d_keras_126 ( (None, 40, 40, 128)       43968     
_________________________________________________________________
batch_normalization_138 (Bat (None, 40, 40, 128)       512       
_________________________________________________________________
bilinear_up_sampling2d_51 (B (None, 80, 80, 128)       0         
_________________________________________________________________
concatenate_51 (Concatenate) (None, 80, 80, 160)       0         
_________________________________________________________________
separable_conv2d_keras_127 ( (None, 80, 80, 64)        11744     
_________________________________________________________________
batch_normalization_139 (Bat (None, 80, 80, 64)        256       
_________________________________________________________________
bilinear_up_sampling2d_52 (B (None, 160, 160, 64)      0         
_________________________________________________________________
concatenate_52 (Concatenate) (None, 160, 160, 67)      0         
_________________________________________________________________
separable_conv2d_keras_128 ( (None, 160, 160, 32)      2779      
_________________________________________________________________
batch_normalization_140 (Bat (None, 160, 160, 32)      128       
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 160, 160, 3)       867       
=================================================================
Total params: 774,809
Trainable params: 769,561
Non-trainable params: 5,248
_________________________________________________________________
